In [5]:
import pandas as pd
  
url = "https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/0e7a9b0a5d22642a06d3d5b9bcbad9890c8ee534/iris.csv"
df = pd.read_csv(url)
  
df_s = df[:5]

In [6]:
df_s

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [3]:
df_s.drop(df_s.index[1])

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [7]:
df = pd.read_csv('./RealEstates.csv')

In [8]:
df.drop(df.index[1])

   Unnamed: 0    Mid     Area         Cost  Address
0           1  30x40  2000000     RR Nagar      NaN
2           2  30x40  4000000          KSR      NaN
3           2  60x40  6000000  Yeshwantpur      NaN
4           1  60x40  5000000       Mysore      NaN

In [10]:
df.to_csv('RealEstates.csv')

In [ ]:
import csv
with open("csv_file", 'r') as file:
    reader = csv.reader(file)
    rows = list(reader)  # Read all rows into a list

rows.pop(row_index)

with open("csv_file", 'w', newline='') as file:
    writer = csv.writer(file)
    writer.writerows(rows)